Repository: pingfangx/TranslatorX-other
Catalog: JavaTutorial/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Here is one example:
zh_cn: 下面是一个例子：

source: Here is one possible implementation:
zh_cn: 这是一个可能的实现：

source: Here is the source code for the improved model, Safelock.
zh_cn: 下面是改善后模型的源代码 Safelock.

source: Here's an example.
zh_cn: 下面是一个例子。

source: High Level Concurrency Objects
zh_cn: 高级并发对象

source: How does a thread support its own interruption?
zh_cn: 如何实现线程支持自己的中断？

source: How would you guarantee that all changes to message will be visible in the main thread?
zh_cn: 您如何保证所有更改message将在主线程中可见？

source: However, as with sleep, join is dependent on the OS for timing, so you should not assume that join will wait exactly as long as you specify.
zh_cn: 然而，和sleep一样，join 依赖于操作系统的计时，所以你不能假定join 等待的时间是精确的。

source: However, even simple statements can translate to multiple steps by the virtual machine.
zh_cn: 然而，即使是一条语句也是会被虚拟机翻译成多个步骤的。

source: However, how exactly the fork/join framework is leveraged by these methods is outside the scope of the Java Tutorials.
zh_cn: 这些方法究竟是如何运用 fork/join 框架并不在本教程的讨论范围内。

source: However, if a Counter object is referenced from multiple threads, interference between threads may prevent this from happening as expected.
zh_cn: 然而，如果一个 Counter 被多个线程引用，那么线程间的干扰就可能导致出现我们不想要的结果。

source: However, it's always possible that interrupt status will immediately be set again, by another thread invoking interrupt.
zh_cn: 当然，它可能因为另一个线程调用 interrupt而让那个中断状态立即被重新设置。

source: However, processes are also important.
zh_cn: 但是，进程也是重要的。

source: However, such strategies require sophisticated analysis and are not for beginners.
zh_cn: 但这需要非常复杂细致的分析，并不适用于初学者。

source: However, synchronization can introduce thread contention, which occurs when two or more threads try to access the same resource simultaneously and cause the Java runtime to execute one or more threads more slowly, or even suspend their execution.
zh_cn: 但是，同步可以引入 线程争用（thread contention）</ e1> </ a0>，当两个或更多个线程尝试同时访问相同的资源时，会发生这种情况并</ e2>导致Java运行时执行 一个或多个线程更慢，甚至暂停执行。

source: However, the definition of execute is less specific.
zh_cn: 然而， execute 没有定义具体的实现方式。

source: However, the threads are not blocked  they are simply too busy responding to each other to resume work.
zh_cn: 然而，线程是不会阻塞的，他们只是会忙于应对彼此的恢复工作。

source: However, there are actions you can specify that are atomic:
zh_cn: 但是，有一些动作可以指定是原子操作：

source: However, these sleep times are not guaranteed to be precise, because they are limited by the facilities provided by the underlying OS.
zh_cn: 然而，这些睡眠时间不能保证是准确的，因为它们受底层操作系统提供的设施的限制。

source: However, this does not eliminate all need to synchronize atomic actions, because memory consistency errors are still possible.
zh_cn: 然而，这并不意味着可以移除对原子操作的同步，因为内存一致性错误还是有可能出现的。

source: However, what the user sees as a single application may in fact be a set of cooperating processes.
zh_cn: 然而,用户将看到一个单独的应用程序可能实际上是一组合作的进程。

source: IPC is used not just for communication between processes on the same system, but processes on different systems.
zh_cn: IPC 不仅用于同个系统的进程之间的通信，也可以用在不同系统的进程。

source: If count is an instance of SynchronizedCounter, then making these methods synchronized has two effects:
zh_cn: 如果count 是SynchronizedCounter的实例，设置其方法为同步方法将有两个效果：

source: If t is a Thread object whose thread is currently executing,
zh_cn: 如果 t 是一个线程正在执行的 Thread 对象，

source: If r is a Runnable object, and e is an Executor object you can replace
zh_cn: 如果r 是一个 Runnable 对象，e 是一个 Executor 对象，可以将

source: If another thread invokes color.set after Statement 1 but before Statement 2, the value of myColorInt won't match the value of myColorName.
zh_cn: 如果有另外一个线程在Statement 1之后、Statement 2之前调用了color.set方法，那么myColorInt 的值和 myColorName的值就会不匹配。

source: If interrupted before it has printed all its messages, the MessageLoop thread prints a message and exits.
zh_cn: 在打印完所有消息之前中断， MessageLoop 线程将打印一条消息并退出。

source: If none of the executors provided by the above factory methods meet your needs, constructing instances of java.util.concurrent.ThreadPoolExecutor or java.util.concurrent.ScheduledThreadPoolExecutor will give you additional options.
zh_cn: 如果上述工厂方法提供的执行器不满足你的需要，创建一个 java.util.concurrent.ThreadPoolExecutor 或 java.util.concurrent.ScheduledThreadPoolExecutor 可以给你额外的选项。

source: If not, why not?
zh_cn: 如果没有，为什么不呢？

source: If one thread invokes this method frequently, other threads that also need frequent synchronized access to the same object will often be blocked.
zh_cn: 如果一个线程频繁调用该方法，其他线程若也需要频繁的同步访问同一个对象，通常就会被阻塞。

source: If the MessageLoop thread takes too long to finish, the main thread interrupts it.
zh_cn: 如果MessageLoop 需要很长时间才能完成，主线程就中断它。

source: If the application simply creates a new thread for every new HTTP request, and the system receives more requests than it can handle immediately, the application will suddenly stop responding to all requests when the overhead of all those threads exceed the capacity of the system.
zh_cn: 如果应用程序只是为每个新的HTTP请求创建一个新的线程，系统收到的请求比它可以立即处理的更多时，所有这些线程的开销超过系统的容量，应用程序将突然停止响应所有</ i1>请求。

source: If the initial value of c is 0, their interleaved actions might follow this sequence:
zh_cn: 如果 c 的初始值是 0，它们交错的操作顺序可能如下：

source: If the instance fields include references to mutable objects, don't allow those objects to be changed:
zh_cn: 如果实例字段包含对可变对象的引用，不要允许更改这些对象：

source: If the other thread's action is also a response to the action of another thread, then livelock may result.
zh_cn: 如果该另一个线程的动作也是对另一个线程的动作的响应，则可能导致 活锁 。

source: If the previous methods are in a subclass of the RecursiveAction class, then setting up the task to run in a ForkJoinPool is straightforward, and involves the following steps:
zh_cn: 如果前面这个方法是在一个 RecursiveAction 子类中，那么设置任务在 ForkJoinPool 是直观的。通常会包含以下一些步骤：

source: If the thread is frequently invoking methods that throw InterruptedException, it simply returns from the run method after it catches that exception.
zh_cn: 如果线程频繁调用抛出 InterruptedException的方法，它只要在 run 方法捕获了异常之后返回即可。

source: If the two statements had been executed in the same thread, it would be safe to assume that the value printed out would be "1".
zh_cn: 如果以上两条语句是在同一个线程中执行的，那么输出的结果自然是1。

source: Immutable Objects
zh_cn: 不可变对象（Immutable Objects）

source: Immutable objects are particularly useful in concurrent applications.
zh_cn: 不可变对象在并发应用程序中特别有用。

source: In JDK 7, java.util.concurrent includes a convenience class, ThreadLocalRandom, for applications that expect to use random numbers from multiple threads or ForkJoinTasks.
zh_cn: 在 JDK7 中，java.util.concurrent 包含了一个相当便利的类 ThreadLocalRandom，可以在当应用程序期望在多个线程或 ForkJoinTask 中使用随机数时使用。

source: In addition, the interface defines scheduleAtFixedRate and scheduleWithFixedDelay, which executes specified tasks repeatedly, at defined intervals.
zh_cn: 该接口还定义了 scheduleAtFixedRate 以及 scheduleWithFixedDelay，它们可以重复地、按指定间隔地执行指定的任务。

source: In all of the previous examples, there's a close connection between the task being done by a new thread, as defined by its Runnable object, and the thread itself, as defined by a Thread object.
zh_cn: 在之前所有的例子中， Thread 对象表示的线程和 Runnable 对象表示的线程所执行的任务之间是紧耦合的。

source: In any case, you cannot assume that invoking sleep will suspend the thread for precisely the time period specified.
zh_cn: 在任何情况下，你不能假设调用sleep 会挂起线程用于指定精确的时间段。

source: In concurrent programming, there are two basic units of execution: processes and threads.
zh_cn: 并发编程的两个基本的执行单元是 进程 和 线程。

source: In more complex applications, it might make more sense to throw an InterruptedException:
zh_cn: 在更复杂的应用程序，它可能会更有意义抛出一个InterruptedException：

source: In programming, an atomic action is one that effectively happens all at once.
zh_cn: 在编程中，原子性（atomic）动作就是指一次性有效完成的动作。

source: In so doing, they give general rules for this kind of conversion and demonstrate some of the advantages of immutable objects.
zh_cn: 通过这个例子说明转化的原则以及使用不可变对象的好处。

source: In such an application, you don't care which thread gets woken up.
zh_cn: 在这样的应用程序中，你不用在乎哪个线程被唤醒。

source: In the Java programming language, concurrent programming is mostly concerned with threads.
zh_cn: 在 Java 中，并发编程主要涉及线程。

source: In this case, the thread acquires the intrinsic lock for the Class object associated with the class.
zh_cn: 在这种情况下，线程获取的是与该类相关的Class 对象的内部锁。

source: In this example, the addName method needs to synchronize changes to lastName and nameCount, but also needs to avoid synchronizing invocations of other objects' methods.
zh_cn: 在上面的标例中 addName 方法需要对lastName 和 nameCount的修改进行同步，但是也需要避免同步调用其他对象的方法。

source: In this example, the data is a series of text messages, which are shared through an object of type Drop:
zh_cn: 在该例子中，数据是一系列文本消息，通过一个Drop类的对象共享：

source: In this example, we can just ignore that exception  we only care about the value of joy.
zh_cn: 在上面的例子中，我们只关心 joy的值，所以忽略了异常。

source: In this section we'll look at some of the high-level concurrency features introduced with version 5.0 of the Java platform.
zh_cn: 在本节中，我们将介绍Java平台版本5.0引入的一些高级并发功能。

source: In this simple example, the code simply tests for the interrupt and exits the thread if one has been received.
zh_cn: 在这个简单的例子中，代码简单地测试该中断，如果已接收到中断线程就退出。

source: Increment the retrieved value by 1.
zh_cn: 对其当前值加 1。

source: Instead of using synchronized methods or otherwise using the lock associated with this, we create two objects solely to provide locks.
zh_cn: 我们创建2个对象各自提供锁，而不是使用同步方法或者使用与this相关的锁。

source: Interference happens when two operations, running in different threads, but acting on the same data, interleave.
zh_cn: 线程间的干扰出现在多个线程对同一个数据进行多个操作的时候，也就是出现了交错（interleave）。

source: Interrupts
zh_cn: 中断（interrupt）

source: Intrinsic Locks and Synchronization
zh_cn: 内部锁和同步

source: Invoking Thread.interrupt sets this flag.
zh_cn: 调用 Thread.interrupt 设置此标志。

source: Invoking wait inside a synchronized method is a simple way to acquire the intrinsic lock.
zh_cn: 在一个同步方法内调用wait 是获取内部锁的简单方法。

source: It is designed for work that can be broken into smaller pieces recursively.
zh_cn: 它被设计用于可以递归地分解成更小的部分的工作。

source: It might not seem possible for operations on instances of Counter to interleave, since both operations on c are single, simple statements.
zh_cn: Counter 类对象的操作貌似不可能出现这种交错（interleave），因为其中的两个关于 c 的操作都很简单，只有一条语句。

source: It's becoming more and more common for computer systems to have multiple processors or processors with multiple execution cores.
zh_cn: 现在多核处理器或多进程的电脑系统越来越流行。

source: It's up to the programmer to decide exactly how a thread responds to an interrupt, but it is very common for the thread to terminate.
zh_cn: 由程序员决定线程如何响应一个中断，但线程终止是非常常见的。

source: Lesson: Concurrency
zh_cn: 课程：并发

source: Let's use Lock objects to solve the deadlock problem we saw in Liveness.
zh_cn: 让我们使用Lock 对象来解决我们在Liveness见到的死锁问题。

source: Let's use guarded blocks to create a Producer-Consumer application.
zh_cn: 让我们用保护块来创建一个Producer-Consumer 应用。

source: Like sleep, join responds to an interrupt by exiting with an InterruptedException.
zh_cn: 和sleep一样， join 通过退出并带着一个 InterruptedException来响应中断。

source: Like execute, submit accepts Runnable objects, but also accepts Callable objects, which allow the task to return a value.
zh_cn: 和 execute一样， submit 接受 Runnable 对象的参数，同时也接受 Callable 对象的参数，Callable对象允许任务返回结果。

source: Like many methods that suspend execution, wait can throw InterruptedException.
zh_cn: 和其他可以暂停线程执行的方法一样wait 会抛出 InterruptedException。

source: Livelock
zh_cn: 活锁（Livelock）

source: Liveness
zh_cn: 活跃度（Liveness）

source: Lock Objects
zh_cn: 锁对象

source: Locks In Synchronized Methods
zh_cn: 同步方法中的锁

source: Make all fields final and private.
zh_cn: 将所有字段定义为final 和 private。

source: Making these operations atomic helps avoid synchronization.
zh_cn: 使这些操作原子化，可以避免同步。

source: Many methods that throw InterruptedException, such as sleep, are designed to cancel their current operation and return immediately when an interrupt is received.
zh_cn: 很多方法会抛出 InterruptedException，如 sleep，被设计成在收到中断时立即取消他们当前的操作并返回。

source: Maximum reliance on immutable objects is widely accepted as a sound strategy for creating simple, reliable code.
zh_cn: 对不可变对象的最大依赖，普遍认为是创建简单可靠代码的良好策略。

source: Memory Consistency Errors
zh_cn: 内存一致性错误

source: Modify the producer-consumer example in Guarded Blocks to use a standard library class instead of the Drop class.
zh_cn: 修改 Guarded Blocks 中的生产者消费者示例，使用标准库类而不是 Drop 类。

source: More sophisticated locking idioms are supported by the java.util.concurrent.locks package.
zh_cn: java.util.concurrent.locks 包提供了更复杂的锁。

source: Most implementations of the Java virtual machine run as a single process.
zh_cn: 大多数 Java 虚拟机的实现作为一个进程运行。

source: Most of the executor implementations in java.util.concurrent use thread pools, which consist of worker threads.
zh_cn: 在java.util.concurrent 包中多数的执行器实现都使用了由 worker threads组成的 thread pools。

source: Most of these features are implemented in the new java.util.concurrent packages.
zh_cn: 大多数功能已经在新的 java.util.concurrent 包中实现。

source: Multiprocess applications are beyond the scope of this lesson.
zh_cn: 多进程应用程序超出了本课的讲解范围。

source: Multithreaded execution is an essential feature of the Java platform.
zh_cn: 多线程执行是 Java 平台的一个重要特点。

source: Neither block will ever end, because each thread is waiting for the other to exit bow.
zh_cn: 无论是哪个线程永远不会结束，因为每个线程都在等待对方退出bow。

source: Never store references to external, mutable objects passed to the constructor; if necessary, create copies, and store references to the copies.
zh_cn: 不要存储对传递给构造函数的外部可变对象的引用; 如有必要，请创建副本，并存储对副本的引用。

source: No side effects of an atomic action are visible until the action is complete.
zh_cn: 在动作没有执行完毕之前，是不会产生可见结果的。

source: Not all classes documented as "immutable" follow these rules.
zh_cn: 不是所有被记录为“不可变”的类都遵循这些规则。

source: Not only is this approach more flexible, but it is applicable to the high-level thread management APIs covered later.
zh_cn: 这不仅更灵活,而且它适用于高级线程管理 API。

source: Note that constructors cannot be synchronized  using the synchronized keyword with a constructor is a syntax error.
zh_cn: 注意：构造函数不能是 synchronized ——在构造函数前使用synchronized 关键字将导致语义错误。

source: Notice that main declares that it throws InterruptedException.
zh_cn: 请注意 main 申明了throws InterruptedException。

source: Notice that both examples invoke Thread.start in order to start the new thread.
zh_cn: 请注意，这两个例子都执行 Thread.start 以启动新的线程。

source: Now you implement the abstract compute() method, which either performs the blur directly or splits it into two smaller tasks.
zh_cn: 接下来你需要实现抽象的compute() 方法，它会直接执行模糊处理，或者将当前的工作拆分成两个更小的任务。

source: Objects that encapsulate these functions are known as executors.
zh_cn: 封装这些功能的对象就是 执行器（executors）.

source: One common type of thread pool is the fixed thread pool.
zh_cn: 一种最常见的线程池是固定大小的线程池。

source: One of them is synchronization, as we will see in the following sections.
zh_cn: 使用同步（synchronization）就是其中之一，这点我们将会在下面的小节中看到。

source: One such implementation, introduced in Java SE 8, is used by the java.util.Arrays class for its parallelSort() methods.
zh_cn: java.util.Arrays 类的parallelSort() 方法就使用了 fork/join 来实现。

source: One way to make Counter safe from thread interference is to make its methods synchronized, as in SynchronizedCounter:
zh_cn: 使用同步是一种使 Counter 类变得线程安全的方法，如SynchronizedCounter：

source: Only one field refers to an object, and that object is itself immutable.
zh_cn: 只有一个字段是指一个对象，该对象本身是不可变的。

source: Overloads of join allow the programmer to specify a waiting period.
zh_cn: 重载 join 方法允许程序员指定等待期。

source: Parallel sorting of large arrays is faster than sequential sorting when run on multiprocessor systems.
zh_cn: 在多处理器系统中，对大数组的并排序会比顺序排序更快。

source: Pausing Execution with Sleep
zh_cn: 用Sleep来暂停执行

source: Performing the blur is accomplished by working through the source array one pixel at a time.
zh_cn: 对图片的模糊操作是通过对 source 数组中的每一个像素点进行处理完成的。

source: Processes
zh_cn: 进程

source: Processes and Threads
zh_cn: 进程和线程

source: Processes are often seen as synonymous with programs or applications.
zh_cn: 进程往往被视为等同于程序或应用程序。

source: Processing time for a single core is shared among processes and threads through an OS feature called time slicing.
zh_cn: 对于单核处理器来说，处理时间是通过时间切片来在进程和线程之间进行共享的。

source: Programmers are often reluctant to employ immutable objects, because they worry about the cost of creating a new object as opposed to updating an object in place.
zh_cn: 序员往往不愿使用不可变对象，因为他们担心创建一个新的对象要比更新对象的成本要高。

source: Questions
zh_cn: 问题

source: Questions and Exercises
zh_cn: 问题和练习

source: Questions and Exercises: Concurrency
zh_cn: 问题和练习：并发

source: Reads and writes are atomic for all variables declared volatile (including long and double variables).
zh_cn: 对 所有 申明为 volatile 的变量的读写是原子的（包括 long 和 double 类型）。

source: Reads and writes are atomic for reference variables and for most primitive variables (all types except long and double).
zh_cn: 对几乎所有的基本数据类型变量（除了 long 和 double）的读写以及引用变量的读写都是原子的。

source: Recall that a thread cannot acquire a lock owned by another thread.
zh_cn: 回忆前面提到的：线程不能获取已经被别的线程获取的锁。

source: Reentrant Synchronization
zh_cn: 重入同步（Reentrant Synchronization）

source: Replacing the int field with an AtomicInteger allows us to prevent thread interference without resorting to synchronization, as in AtomicCounter:
zh_cn: 将 int 替换为 AtomicInteger 允许我们在不进行同步的情况下阻止线程干扰，如 AtomicCounter：

source: Retrieve the current value of c.
zh_cn: 获取 c的当前值。

source: Run the task.
zh_cn: 执行任务。

source: Second, when a synchronized method exits, it automatically establishes a happens-before relationship with any subsequent invocation of a synchronized method for the same object.
zh_cn: 其次，当一个同步方法退出时，会自动与该对象的同步方法的任何后续调用 建立 happens-before 关系。

source: See the section Liveness for more information.
zh_cn: 更多信息参见Liveness ：

source: Seeing that they are still blocking each other, Alphone moves to his right, while Gaston moves to his left.
zh_cn: 看到他们仍然相互阻挠，Alphone向右移动，而Gaston向左移动。

source: Several factory methods are ScheduledExecutorService versions of the above executors.
zh_cn: 上述执行器的几个工厂方法ScheduledExecutorService 版本的。

source: Similarly, create copies of your internal mutable objects when necessary to avoid returning the originals in your methods.
zh_cn: 同样如果需要返回内部的可变对象时，不要返回可变对象本身，而是返回其拷贝。

source: Since an image is a large array, this process can take a long time.
zh_cn: 因为一张图片会由一个很大的数组来表示，这个流程会花费一段较长的时间。

source: Since they cannot change state, they cannot be corrupted by thread interference or observed in an inconsistent state.
zh_cn: 因为他们不能改变状态，它们不能被线程干扰所中断或者被其他线程观察到内部不一致的状态。

source: Since this application has not defined another thread to cause the interrupt, it doesn't bother to catch InterruptedException.
zh_cn: 由于该应用程序还没有定义的另一个线程来引起的中断，所以考虑捕捉 InterruptedException。

source: Since version 5.0, the Java platform has also included high-level concurrency APIs.
zh_cn: 自5.0版本以来，Java平台还包括高级并发API。

source: So far, this lesson has focused on the low-level APIs that have been part of the Java platform from the very beginning.
zh_cn: 目前为止，之前的教程都是重点讲述了一开始就作为 Java 平台一部分的低级别 API。

source: Software that can do such things is known as concurrent software.
zh_cn: 可以执行此类操作的软件称为 并发 软件。

source: Some time after the second thread has released the lock, the first thread reacquires the lock and resumes by returning from the invocation of wait.
zh_cn: 在第二个线程释放锁一段时间后，第一个线程重新获取该锁，并通过从调用 wait 的返回来恢复。

source: Standard Implementations
zh_cn: 标准实现

source: Starvation
zh_cn: 饥饿（Starvation）

source: Starvation and Livelock
zh_cn: 饥饿和活锁（Starvation and Livelock）

source: Starvation and livelock are much less common a problem than deadlock, but are still problems that every designer of concurrent software is likely to encounter.
zh_cn: 饥饿和活锁虽比死锁问题稍微不常见点，但这些是在并发软件中每一个设计者仍然可能会遇到的问题。

source: Store the incremented value back in c.
zh_cn: 将增加后的值存储到 c中。

source: Such a block begins by polling a condition that must be true before the block can proceed.
zh_cn: 这样的块在运行前通过轮询检查一个条件，直到为真时才开始。

source: Such a method could, in theory, simply loop until the condition is satisfied, but that loop is wasteful, since it executes continuously while waiting.
zh_cn: 这种方法在理论上可以简单地循环，直到条件满足为止，但是循环是浪费的，因为它在等待时持续执行。

source: Supporting Interruption
zh_cn: 支持中断

source: Suppose d is the object we're using to invoke wait.
zh_cn: 假设 d 是用来调用 wait的对象。

source: Suppose Thread A invokes increment at about the same time Thread B invokes decrement.
zh_cn: 假定线程 A 中调用 increment方法，同时线程 B 中调用 decrement方法。

source: Suppose a simple int field is defined and initialized:
zh_cn: 假定定义了一个简单的 int 类型的字段并对其进行了初始化：

source: Suppose that you want to blur an image.
zh_cn: 假设你想要模糊一张图片。

source: Suppose, for example guardedJoy is a method that must not proceed until a shared variable joy has been set by another thread.
zh_cn: 比如，假设guardedJoy 方法必须等待另外的线程给共享变量 joy 设置值才能继续执行。

source: Suppose, for example, a thread executes the following code:
zh_cn: 比如，假设一个线程执行了以下代码：

source: Suppose, for example, class MsLunch has two instance fields, c1 and c2, that are never used together.
zh_cn: 例如，假如类MsLunch 有两个实例字段， c1 和 c2，这两个变量绝不会一起使用。

source: Synchronization
zh_cn: 同步（Synchronization）

source: Synchronization is built around an internal entity known as the intrinsic lock or monitor lock.
zh_cn: 同步是构建在被称为内部锁（intrinsic lock） 或 监视锁（monitor lock）的内部实体上的。

source: Synchronized Methods
zh_cn: 同步方法

source: Synchronized Statements
zh_cn: 同步语名块

source: Synchronized code relies on a simple kind of reentrant lock.
zh_cn: 同步代码依赖于一种简单的可重入锁。

source: Synchronized methods enable a simple strategy for preventing thread interference and memory consistency errors: if an object is visible to more than one thread, all reads or writes to that object's variables are done through synchronized methods.
zh_cn: 同步方法是一种简单的可以避免线程相互干扰和内存一致性错误的策略：如果一个对象对多个线程都是可见的，那么所有对该对象的变量的读写都应该是通过 同步 方法完成的。

source: Synchronized statements are also useful for improving concurrency with fine-grained synchronization.
zh_cn: 同步语句块对于通过细粒度（fine-grained）的同步来提高并发性也是有用的。

source: Synchronizing constructors doesn't make sense, because only the thread that creates an object should have access to it while it is being constructed.
zh_cn: 同步构造函数没有意义，因为创建对象的线程在构造时应该可以访问它。

source: Tasks are submitted to the pool via an internal queue, which holds extra tasks whenever there are more active tasks than threads.
zh_cn: 需要执行的任务通过一个内部队列提交给线程，当没有更多的工作线程可以用来执行任务时，队列保存额外的任务。

source: That is, a set has a happens-before relationship with any subsequent get on the same variable.
zh_cn: 就是说，同一变量上的一个 set 操作对于任意后续的 get 操作存在 happens-before 关系。

source: The SleepMessages example uses sleep to print messages at four-second intervals:
zh_cn: SleepMessages示例中使用sleep每隔4秒来打印消息。

source: The Executor interface provides a single method, execute, designed to be a drop-in replacement for a common thread-creation idiom.
zh_cn: Executor 提供一个简单的execute方法，用来替代通常创建线程的做法。

source: The ExecutorService interface supplements execute with a similar, but more versatile submit method.
zh_cn: ExecutorService 接口相似地提供了execute ，并且更通用地提供了 submit 方法。

source: The ScheduledExecutorService interface supplements the methods of its parent ExecutorService with schedule, which executes a Runnable or Callable task after a specified delay.
zh_cn: ScheduledExecutorService 扩展了 ExecutorService 接口，并添加了 schedule 方法，它在指定的延时后执行一个 Runnable 或 Callable 任务。

source: The java.util.concurrent.atomic package defines classes that support atomic operations on single variables.
zh_cn: java.util.concurrent.atomic 包定义了对单一变量进行原子操作的类。

source: The newCachedThreadPool method creates an executor with an expandable thread pool.
zh_cn: newCachedThreadPool 创建一个具有可扩展线程池的执行器。

source: The newSingleThreadExecutor method creates an executor that executes a single task at a time.
zh_cn: newSingleThreadExecutor 创建一个执行单个任务的执行器。

source: The Executor Interface
zh_cn: Executor 接口

source: The ExecutorService Interface
zh_cn: ExecutorService 接口

source: The MessageLoop thread prints out a series of messages.
zh_cn: MessageLoop 线程打印出一系列消息。

source: The ScheduledExecutorService Interface
zh_cn: ScheduledExecutorService 接口
